#Область ПрограммныйИнтерфейс 
Процедура ДополнитьФорму (Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;	
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);  
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КЛ_КонтактноеЛицо",Тип ("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо"; 
	ПолеВвода.Заголовок = "Контактное лицо"
	
КонецПроцедуры   

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КЛ_КонтактноеЛицо",Тип ("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо"; 
	ПолеВвода.Заголовок = "Контактное лицо"
	
КонецПроцедуры  

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаСкидка(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("КЛ_СогласованнаяСкидка",Тип ("ПолеФормы"),Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КЛ_СогласованнаяСкидка"; 
	ПолеВвода.Заголовок = "СогласованнаяСкидка";
	ПолеВвода.МаксимальноеЗначение = 100;
	ПолеВвода.УстановитьДействие("ПриИзменении", "КЛ_СогласованнаяСкидкаПриИзменении");
		
	Команда = Форма.Команды.Добавить ("Пересчитать");
	Команда.Заголовок = "Пересчитать";
	Команда.Действие = "Пересчитать";
	
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитать",Тип("КнопкаФормы"),Форма.Элементы.ГруппаСкидка);
	КнопкаФормы.ИмяКоманды = "Пересчитать";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаФормы.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры 
 
#КонецОбласти